#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=d5b8019e988cf130c7b7cfd5968d1c70ded751cc]
null_resource.always_run: Refreshing state... [id=6150670911962373227]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=5400267922874720274]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform planned the following actions, but then encountered a problem:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "6150670911962373227" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2024-10-10T04:03:56Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "5400267922874720274" -> (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*